# Используем официальный лёгкий образ Node.js
# Alpine — минимальный Linux-дистрибутив, что уменьшает размер образа
FROM node:22-alpine
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app
# Копируем файлы зависимостей
# Это делается отдельно для кэширования слоёв: если код изменился, а package.json нет —зависимости переустановятся не будут
COPY package*.json ./
# Устанавливаем зависимости
RUN npm install --production
# Копируем остальной код приложения
COPY . .
# Сообщаем, какой порт слушает приложение (документация)
EXPOSE 3000
# Команда запуска приложения
CMD ["node", "index.js"]